# Написать программу, которая будет выводить топ 10 самых часто встречающихся в новостях слов длиннее 6 символов для каждого файла.

# Принцип работы программы:
# 1 - работа с json файлом
# 2 - работа с xml файлом
# 0 - выход из программы

# 1: 
# Фунция Ф1: чтение .json файла, на входе файл, на выходе словарь
# Далее идет основная Ф2, которая проходит по каждому ключу (в данном случае это id) и для каждого вызывает Ф3
# Ф3: проходит по спискам и в кажлом списке находит 10 самых часто встрчающихся слов длиннее 6 символов

# 2: 
# Фунция Ф4: чтение .xml файла, на входе файл, на выходе словарь
# Далее идет основная Ф2, которая проходит по каждому ключу (в данном случае это id) и для каждого вызывает Ф3
# Ф3: проходит по спискам и в кажлом списке находит 10 самых часто встрчающихся слов длиннее 6 символов





