# 1 
# Даны два целых числа A и B (при этом A ≤ B). Выведите все числа от A до B включительно.

A = int(input())
B = int(input())
for i in range (A, B + 1):
    print (i)

# 2
# Даны два целых числа A и В. Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.

A = int(input())
B = int(input())

if A <= B:
    for i in range (A, B + 1):
        print (i)
else:
    for i in range (A, B -1, -1):
        print (i)
        
# 3
# Даны два целых числа A и В, A>B. 
# Выведите все нечётные числа от A до B включительно, в порядке убывания. 
# В этой задаче можно обойтись без инструкции if.
A = int(input())
B = int(input())

for i in range (A, B - 1, -1):
    if (i % 2 != 0):
        print (i)
        
# решение разработчиков:
for i in range(a - (a + 1) % 2, b - b % 2, -2):
    print(i, end=' ')
